In [16]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [17]:
# postgresql://username:password@hostname/dbname
%sql postgresql://postgres:postgrepassword@localhost/

[Data](../Data/SQL/Transaction%20Data.csv)
```sql
CREATE TABLE transactions (
  transaction_id SERIAL PRIMARY KEY,
  customer_id INTEGER,
  product_id INTEGER,
  transaction_date DATE,
  quantity INTEGER,
  unit_price FLOAT8,
  discount FLOAT8,
  pre_discount_total_price DOUBLE PRECISION,
  grand_total_price DOUBLE PRECISION,
  payment_method VARCHAR(50),
  employee_id INTEGER,
  credit_card_number VARCHAR(50),
  credit_card_type VARCHAR(50)
);
```

In [18]:
%%sql
SELECT COUNT(transaction_id) from transactions

 * postgresql://postgres:***@localhost/
1 rows affected.

[(6000,)]

In [40]:
%%sql
WITH total_sales AS (
  SELECT
    employee_id,
    SUM(grand_total_price) AS total_sales
  FROM
    transactions
  GROUP BY
    employee_id
)
SELECT
  CONCAT(u.First_Name, ' ',u.Last_Name) AS "Full Name",
  u.department AS "Department",
  t.total_sales::float8::numeric::money AS "Total Personal Sales",
  SUM(t.total_sales) OVER(PARTITION BY u.department)::float8::numeric::money AS "Total Sales in the Department",
  TO_CHAR(t.total_sales/SUM(t.total_sales) OVER(PARTITION BY u.department),'fm0D00000%') AS "Share"
FROM
  total_sales AS t
LEFT JOIN
  users AS u ON t.employee_id = u.employee_id -- USING(employee_id)
ORDER BY "Total Personal Sales" DESC
LIMIT 10

 * postgresql://postgres:***@localhost/
10 rows affected.

[('Juanita Broose', 'Accounting', '$4,490,380.00', '$118,642,437.20', '0.03785%'),
 ('Georgine Santer', 'Marketing', '$3,625,642.40', '$121,732,389.87', '0.02978%'),
 ('Sloane Densun', 'Services', '$3,614,011.64', '$84,235,607.26', '0.04290%'),
 ('Anya Klein', 'Product Management', '$3,583,720.74', '$102,532,754.72', '0.03495%'),
 ('Elysia Foulgham', 'Accounting', '$3,559,545.24', '$118,642,437.20', '0.03000%'),
 ('Crosby Hedge', 'Business Development', '$3,547,633.24', '$79,325,343.24', '0.04472%'),
 ('Nikolia Baysting', 'Marketing', '$3,481,948.26', '$121,732,389.87', '0.02860%'),
 ('Deane Hawksworth', 'Training', '$3,452,328.74', '$112,581,523.50', '0.03067%'),
 ('Abdul Fugere', 'Training', '$3,447,455.92', '$112,581,523.50', '0.03062%'),
 ('Milt Larby', 'Marketing', '$3,369,522.84', '$121,732,389.87', '0.02768%')]

In [41]:
%%sql
WITH total_sales AS (
  SELECT
    employee_id,
    SUM(grand_total_price) AS total_sales
  FROM
    transactions
  GROUP BY
    employee_id
)
SELECT
  CONCAT(u.First_Name, ' ',u.Last_Name) AS "Full Name",
  u.department AS "Department",
  t.total_sales::float8::numeric::money AS "Total Personal Sales",
  SUM(t.total_sales) OVER(PARTITION BY u.department)::float8::numeric::money AS "Total Sales in the Department",
  TO_CHAR(t.total_sales/SUM(t.total_sales) OVER(PARTITION BY u.department),'fm0D00000%') AS "Share"
FROM
  total_sales AS t
LEFT JOIN
  users AS u ON t.employee_id = u.employee_id -- USING(employee_id)
ORDER BY "Share" DESC
LIMIT 10

 * postgresql://postgres:***@localhost/
10 rows affected.

[('Crosby Hedge', 'Business Development', '$3,547,633.24', '$79,325,343.24', '0.04472%'),
 ('Sloane Densun', 'Services', '$3,614,011.64', '$84,235,607.26', '0.04290%'),
 ('Kristine Minister', 'Business Development', '$3,005,699.60', '$79,325,343.24', '0.03789%'),
 ('Juanita Broose', 'Accounting', '$4,490,380.00', '$118,642,437.20', '0.03785%'),
 ('Ellynn Manginot', 'Business Development', '$2,965,153.61', '$79,325,343.24', '0.03738%'),
 ('Alisa LeEstut', 'Business Development', '$2,806,269.77', '$79,325,343.24', '0.03538%'),
 ('Byrle Lago', 'Services', '$2,970,105.87', '$84,235,607.26', '0.03526%'),
 ('Anya Klein', 'Product Management', '$3,583,720.74', '$102,532,754.72', '0.03495%'),
 ('Chickie Humphris', 'Business Development', '$2,761,262.73', '$79,325,343.24', '0.03481%'),
 ('Kalle Hulstrom', 'Services', '$2,817,435.77', '$84,235,607.26', '0.03345%')]